{"company_name_ticker":{"0":"V.F. Corporation(VFC)"},"profile":{"0":"V.F. Corporation engages in the design, production, procurement, marketing, and distribution of branded lifestyle apparel, footwear, and related products for men, women, and children in the Americas, Europe, and the Asia-Pacific. It operates through four segments: Outdoor, Active, Work, and Jeans. The company offers outdoor, merino wool and other natural fibers-based, surf-inspired, occupational, lifestyle, sporting, and casual apparel; equipment; accessories; outdoor lifestyle, performance-based, youth culture\/action sports-inspired, and protective work footwear; handbags, luggage, backpacks, totes, and travel accessories; work and work-inspired lifestyle apparel and footwear; and denim, as well as uniform programs for business and governmental organizations. It provides its products under the North Face, Timberland, Smartwool, Icebreaker, Altra, Vans Napapijri, Kipling, Eastpak, JanSport, Reef, Eagle Creek, Dickies, Red Kap, Bulwark, Timberland PRO, VF Solutions, Wrangler RIGGS, Walls, Terra, Workrite, Kodiak, Horace Small, Wrangler, Lee, Lee Riders, and Rock & Republic brands. The company sells its products primarily to specialty stores, department stores, national chains, and mass merchants, as well as sells through direct-to-consumer operations, including company operated stores, concession retail stores, and brand e-commerce sites. V.F. Corporation was founded in 1899 and is based in Greenwood Village, Colorado."},"market_cap":{"0":"22.30B"},"div":{"0":"1.92"},"shares_outstanding":{"0":"402.82M"},"shares_float":{"0":"365.87M"},"prev_close":{"0":"62.72"},"fifty_two_weeks":{"0":"60.87 - 100.25"},"beta":{"0":"1.21"},"net_income":{"0":"1.34B"},"revenue":{"0":"12.26B"},"gross_margin":{"0":"53.60%"},"quick_ratio":{"0":"1.30"},"current_ratio":{"0":"2.10"},"debt_equity":{"0":"0.48"},"op_margin":{"0":"11.90%"},"profit_margin":{"0":"10.50%"},"sales_qonq":{"0":"4.90%"},"roa":{"0":"12.10%"},"roe":{"0":"29.30%"},"roi":{"0":"20.40%"},"eps_ttm":{"0":"3.34"},"eps_fwd":{"0":"3.69"},"eps_qonq":{"0":"7.80%"},"book_value_share":{"0":"11.54"},"cash_share":{"0":"1.45"},"pe":{"0":"16.56"},"pe_fwd":{"0":"14.99"},"peg":{"0":"1.66"},"ps":{"0":"1.82"},"pb":{"0":"4.80"},"pc":{"0":"38.18"},"pfcf":{"0":"352.23"}}