{"company_name_ticker":{"0":"NVIDIA Corporation(NVDA)"},"profile":{"0":"NVIDIA Corporation operates as a visual computing company worldwide. It operates in two segments, GPU and Tegra Processor. The GPU segment offers processors, which include GeForce for PC gaming and mainstream PCs; GeForce NOW for cloud-based gaming; Quadro for design professionals working in computer-aided design, video editing, special effects, and other creative applications; Tesla for artificial intelligence (AI) utilizing deep learning, accelerated computing, and general purpose computing; GRID, which provides power of NVIDIA graphics through the cloud and datacenters; DGX for AI scientists, researchers, and developers; and EGX for accelerated AI computing at the edge. The Tegra Processor segment provides processors comprising SHIELD devices and services designed to harness the power of mobile-cloud to revolutionize home entertainment, AI, and gaming; AGX, a power-efficient AI computing platform for intelligent edge devices; DRIVE AGX for self-driving vehicles; Clara AGX for medical instruments; and Jetson AGX for robotics and other embedded use. The company's products are used in gaming, professional visualization, datacenter, and automotive markets. NVIDIA Corporation sells its products to original equipment manufacturers, original device manufacturers, system builders, add-in board manufacturers, retailers\/distributors, Internet and cloud service providers, automotive manufacturers and tier-1 automotive suppliers, mapping companies, start-ups, and other ecosystem participants. NVIDIA Corporation was founded in 1993 and is headquartered in Santa Clara, California."},"market_cap":{"0":"135.99B"},"div":{"0":"0.64"},"shares_outstanding":{"0":"628.68M"},"shares_float":{"0":"586.45M"},"prev_close":{"0":"246.47"},"fifty_two_weeks":{"0":"132.60 - 316.32"},"beta":{"0":"1.66"},"net_income":{"0":"2.80B"},"revenue":{"0":"10.92B"},"gross_margin":{"0":"62.00%"},"quick_ratio":{"0":"7.10"},"current_ratio":{"0":"7.70"},"debt_equity":{"0":"0.00"},"op_margin":{"0":"26.10%"},"profit_margin":{"0":"25.60%"},"sales_qonq":{"0":"40.80%"},"roa":{"0":"18.10%"},"roe":{"0":"25.70%"},"roi":{"0":"18.80%"},"eps_ttm":{"0":"4.52"},"eps_fwd":{"0":"9.30"},"eps_qonq":{"0":"183.50%"},"book_value_share":{"0":"20.04"},"cash_share":{"0":"17.33"},"pe":{"0":"47.84"},"pe_fwd":{"0":"23.26"},"peg":{"0":"3.65"},"ps":{"0":"12.46"},"pb":{"0":"10.79"},"pc":{"0":"12.48"},"pfcf":{"0":"35.03"}}