{"company_name_ticker":{"0":"Microsoft Corporation(MSFT)","1":"HCA Healthcare, Inc.(HCA)","2":"The Procter & Gamble Company(PG)"},"profile":{"0":"Microsoft Corporation develops, licenses, and supports software, services, devices, and solutions worldwide. The company's Productivity and Business Processes segment offers Office, Exchange, SharePoint, Microsoft Teams, Office 365 Security and Compliance, and Skype for Business, as well as related Client Access Licenses (CAL); and Skype, Outlook.com, and OneDrive. It also provides LinkedIn that includes Talent and marketing solutions, and subscriptions; and Dynamics 365, a set of cloud-based and on-premises business solutions for small and medium businesses, large organizations, and divisions of enterprises. The company's Intelligent Cloud segment licenses SQL and Windows Servers, Visual Studio, System Center, and related CALs; GitHub that provides a collaboration platform and code hosting service for developers; and Azure, a cloud platform. It also provides support services and Microsoft consulting services to assist customers in developing, deploying, and managing Microsoft server and desktop solutions; and training and certification to developers and IT professionals on various Microsoft products. The company's More Personal Computing segment offers Windows OEM licensing and other non-volume licensing of the Windows operating system; Windows Commercial comprising volume licensing of the Windows operating system, Windows cloud services, and other Windows commercial offerings; patent licensing; Windows Internet of Things; and MSN advertising. It also provides Microsoft Surface, PC accessories, and other intelligent devices; Gaming, including Xbox hardware, and Xbox software and services; video games and third-party video game royalties; and Search, including Bing and Microsoft advertising. The company sells its products through distributors and resellers; and directly through digital marketplaces, online stores, and retail stores. It has strategic partnerships with Humana Inc. and Nokia. The company was founded in 1975 and is headquartered in Redmond, Washington.","1":"HCA Healthcare, Inc., through its subsidiaries, provides health care services in the United States. The company operates general, acute care hospitals that offer medical and surgical services, including inpatient care, intensive care, cardiac care, diagnostic, and emergency services; and outpatient services, such as outpatient surgery, laboratory, radiology, respiratory therapy, cardiology, and physical therapy services. It also operates psychiatric hospitals, which provide therapeutic programs comprising child, adolescent and adult psychiatric care, and adolescent and adult alcohol and drug abuse treatment and counseling. In addition, the company operates outpatient health care facilities consisting of freestanding ambulatory surgery centers, freestanding emergency care facilities, urgent care facilities, walk-in clinics, diagnostic and imaging centers, rehabilitation and physical therapy centers, radiation and oncology therapy centers, physician practices, and various other facilities. As of December 31, 2019, it operated 184 hospitals and 123 freestanding surgery centers located in 21 states and England. The company was formerly known as HCA Holdings, Inc. HCA Healthcare, Inc. was founded in 1968 and is headquartered in Nashville, Tennessee.","2":"The Procter & Gamble Company provides branded consumer packaged goods to consumers in North and Latin America, Europe, the Asia Pacific, Greater China, India, the Middle East, and Africa. It operates in five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments; and antiperspirants and deodorants, and personal cleansing and skin care products under the Head & Shoulders, Herbal Essences, Pantene, Rejoice, Olay, Old Spice, Safeguard, SK-II, and Secret brands. The Grooming segment provides female and male blades and razors, pre- and post-shave products, and other shave care products; and appliances that include electric shavers and epilators under the Braun, Gillette, and Venus brands. The Health Care segment offers toothbrushes, toothpaste, and other oral care products; and gastrointestinal, rapid diagnostics, respiratory, vitamins\/minerals\/supplements, pain relief, and other personal health care products under the Crest, Oral-B, Metamucil, Neurobion, Pepto Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents; and air care, dish care, P&G professional, and surface care products under the Ariel, Downy, Gain, Tide, Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment baby wipes, taped diapers, and pants; adult incontinence and feminine care products; and paper towels, tissues, and toilet papers under the Luvs, Pampers Always, Always Discreet, Tampax Bounty, Charmin, and Puffs brands. The company sells its products through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, baby stores, specialty beauty stores, high-frequency stores, and pharmacies. The Procter & Gamble Company was founded in 1837 and is headquartered in Cincinnati, Ohio."},"market_cap":{"0":"1088.46B","1":"34.52B","2":"251.43B"},"dividend":{"0":"2.04","1":"1.72","2":"2.98"},"shares_outstanding":{"0":"7.83B","1":"340.10M","2":"2.47B"},"shares_float":{"0":"7.50B","1":"265.39M","2":"2.47B"},"prev_close":{"0":"153.63","1":"112.59","2":"111.59"}}