{"company_name_ticker":{"0":"V.F. Corporation(VFC)","1":"NVIDIA Corporation(NVDA)","2":"Activision Blizzard, Inc.(ATVI)"},"profile":{"0":"V.F. Corporation engages in the design, production, procurement, marketing, and distribution of branded lifestyle apparel, footwear, and related products for men, women, and children in the Americas, Europe, and the Asia-Pacific. It operates through four segments: Outdoor, Active, Work, and Jeans. The company offers outdoor, merino wool and other natural fibers-based, surf-inspired, occupational, lifestyle, sporting, and casual apparel; equipment; accessories; outdoor lifestyle, performance-based, youth culture\/action sports-inspired, and protective work footwear; handbags, luggage, backpacks, totes, and travel accessories; work and work-inspired lifestyle apparel and footwear; and denim, as well as uniform programs for business and governmental organizations. It provides its products under the North Face, Timberland, Smartwool, Icebreaker, Altra, Vans Napapijri, Kipling, Eastpak, JanSport, Reef, Eagle Creek, Dickies, Red Kap, Bulwark, Timberland PRO, VF Solutions, Wrangler RIGGS, Walls, Terra, Workrite, Kodiak, Horace Small, Wrangler, Lee, Lee Riders, and Rock & Republic brands. The company sells its products primarily to specialty stores, department stores, national chains, and mass merchants, as well as sells through direct-to-consumer operations, including company operated stores, concession retail stores, and brand e-commerce sites. V.F. Corporation was founded in 1899 and is based in Greenwood Village, Colorado.","1":"NVIDIA Corporation operates as a visual computing company worldwide. It operates in two segments, GPU and Tegra Processor. The GPU segment offers processors, which include GeForce for PC gaming and mainstream PCs; GeForce NOW for cloud-based gaming; Quadro for design professionals working in computer-aided design, video editing, special effects, and other creative applications; Tesla for artificial intelligence (AI) utilizing deep learning, accelerated computing, and general purpose computing; GRID, which provides power of NVIDIA graphics through the cloud and datacenters; DGX for AI scientists, researchers, and developers; and EGX for accelerated AI computing at the edge. The Tegra Processor segment provides processors comprising SHIELD devices and services designed to harness the power of mobile-cloud to revolutionize home entertainment, AI, and gaming; AGX, a power-efficient AI computing platform for intelligent edge devices; DRIVE AGX for self-driving vehicles; Clara AGX for medical instruments; and Jetson AGX for robotics and other embedded use. The company's products are used in gaming, professional visualization, datacenter, and automotive markets. NVIDIA Corporation sells its products to original equipment manufacturers, original device manufacturers, system builders, add-in board manufacturers, retailers\/distributors, Internet and cloud service providers, automotive manufacturers and tier-1 automotive suppliers, mapping companies, start-ups, and other ecosystem participants. NVIDIA Corporation was founded in 1993 and is headquartered in Santa Clara, California.","2":"Activision Blizzard, Inc. develops and distributes content and services on video game consoles, personal computers (PC), and mobile devices. The company operates through three segments: Activision Publishing, Inc.; Blizzard Entertainment, Inc.; and King Digital Entertainment. It develops, publishes, and sells interactive software products and entertainment content for the console and PC platforms through retail and digital channels, including subscription, full-game, and in-game sales, as well as by licensing software to third-party or related-party companies; and offers downloadable content. The company also maintains a proprietary online gaming service, Battle.net that facilitates the creation of user generated content, digital distribution, and online social connectivity in its games; and develops and publishes interactive entertainment content and services primarily on mobile platforms, such as Android and iOS, as well as distributes its content and services on the PC platform primarily through Facebook. In addition, it engages in creating original film and television content; and provides warehousing, logistics, and sales distribution services to third-party publishers of interactive entertainment software, as well as manufacturers of interactive entertainment hardware products. The company's products include various genres, including first-person shooter, action\/adventure, role-playing, strategy, and others. It serves retailers and distributors, including mass-market retailers, first party digital storefronts, consumer electronics stores, discount warehouses, and game specialty stores through third-party distribution and licensing arrangements in the United States, Australia, Brazil, Canada, China, France, Germany, Ireland, Italy, Japan, Malta, Mexico, the Netherlands, Romania, Singapore, South Korea, Spain, Sweden, Taiwan, and the United Kingdom. The company was incorporated in 1979 and is headquartered in Santa Monica, California."},"market_cap":{"0":"22.30B","1":"135.99B","2":"43.05B"},"dividend":{"0":"1.92","1":"0.64","2":"0.41"},"shares_outstanding":{"0":"402.82M","1":"628.68M","2":"789.10M"},"shares_float":{"0":"365.87M","1":"586.45M","2":"758.59M"},"prev_close":{"0":"62.72","1":"246.47","2":"59.33"}}