{"company_name_ticker":{"0":"Microsoft Corporation(MSFT)"},"profile":{"0":"Microsoft Corporation develops, licenses, and supports software, services, devices, and solutions worldwide. The company's Productivity and Business Processes segment offers Office, Exchange, SharePoint, Microsoft Teams, Office 365 Security and Compliance, and Skype for Business, as well as related Client Access Licenses (CAL); and Skype, Outlook.com, and OneDrive. It also provides LinkedIn that includes Talent and marketing solutions, and subscriptions; and Dynamics 365, a set of cloud-based and on-premises business solutions for small and medium businesses, large organizations, and divisions of enterprises. The company's Intelligent Cloud segment licenses SQL and Windows Servers, Visual Studio, System Center, and related CALs; GitHub that provides a collaboration platform and code hosting service for developers; and Azure, a cloud platform. It also provides support services and Microsoft consulting services to assist customers in developing, deploying, and managing Microsoft server and desktop solutions; and training and certification to developers and IT professionals on various Microsoft products. The company's More Personal Computing segment offers Windows OEM licensing and other non-volume licensing of the Windows operating system; Windows Commercial comprising volume licensing of the Windows operating system, Windows cloud services, and other Windows commercial offerings; patent licensing; Windows Internet of Things; and MSN advertising. It also provides Microsoft Surface, PC accessories, and other intelligent devices; Gaming, including Xbox hardware, and Xbox software and services; video games and third-party video game royalties; and Search, including Bing and Microsoft advertising. The company sells its products through distributors and resellers; and directly through digital marketplaces, online stores, and retail stores. It has strategic partnerships with Humana Inc. and Nokia. The company was founded in 1975 and is headquartered in Redmond, Washington."},"market_cap":{"0":"1088.46B"},"div":{"0":"2.04"},"shares_outstanding":{"0":"7.83B"},"shares_float":{"0":"7.50B"},"prev_close":{"0":"153.63"},"fifty_two_weeks":{"0":"112.65 - 190.70"},"beta":{"0":"1.09"},"net_income":{"0":"41.72B"},"revenue":{"0":"134.25B"},"gross_margin":{"0":"67.70%"},"quick_ratio":{"0":"2.80"},"current_ratio":{"0":"2.80"},"debt_equity":{"0":"0.71"},"op_margin":{"0":"36.70%"},"profit_margin":{"0":"33.00%"},"sales_qonq":{"0":"13.70%"},"roa":{"0":"15.90%"},"roe":{"0":"42.90%"},"roi":{"0":"19.90%"},"eps_ttm":{"0":"5.41"},"eps_fwd":{"0":"6.31"},"eps_qonq":{"0":"37.20%"},"book_value_share":{"0":"14.45"},"cash_share":{"0":"17.15"},"pe":{"0":"25.72"},"pe_fwd":{"0":"22.05"},"peg":{"0":"1.73"},"ps":{"0":"8.11"},"pb":{"0":"9.62"},"pc":{"0":"8.11"},"pfcf":{"0":"41.64"}}